{"chat": [{"usr": "Customer", "msg": "Ho ho ho!", "tones": {"document_tone": {"tones": []}}}, {"usr": "Support", "msg": "Fuck you!", "tones": {"document_tone": {"tones": []}}}, {"usr": "yeeet", "msg": "you a ho", "tones": {"document_tone": {"tones": []}}}, {"usr": "yeeet", "msg": "what the heck", "tones": {"document_tone": {"tones": []}}}, {"usr": "yeeet", "msg": "ff", "tones": {"document_tone": {"tones": []}}}, {"usr": "yeeet", "msg": "", "tones": {"document_tone": {"tones": []}}}, {"usr": "yeeet", "msg": "f", "tones": {"document_tone": {"tones": []}}}, {"usr": "yeeet", "msg": "f", "tones": {"document_tone": {"tones": []}}}, {"usr": "yeeet", "msg": "fs", "tones": {"document_tone": {"tones": []}}}, {"usr": "yeeet", "msg": "f", "tones": {"document_tone": {"tones": []}}}, {"usr": "yeeet", "msg": "sdg", "tones": {"document_tone": {"tones": []}}}, {"usr": "yeeet", "msg": "sd", "tones": {"document_tone": {"tones": []}}}, {"usr": "yeeet", "msg": "g", "tones": {"document_tone": {"tones": []}}}, {"usr": "Support", "msg": "I want to thank you for going above and beyond with your customer service. I've received positive feedback about your interactions. It's not always easy to satisfy customers with the kinds of requests they make. There are times when it takes creativity and drive to exceed customer expectations. You're willing to take a risk without having to ask a lot of questions. You treat customers as if you're the owner of the company.", "tones": {"document_tone": {"tones": [{"score": 0.599005, "tone_id": "joy", "tone_name": "Joy"}]}}}, {"usr": "Support", "msg": "Thank you for handling that difficult customer with all the specific questions and requests. Not many employees could have handled the complexity the way you did. You approached the challenge with willingness and grace. I'll keep you in mind as my own consultant for customer service. Thanks for being a role model.", "tones": {"document_tone": {"tones": [{"score": 0.700772, "tone_id": "analytical", "tone_name": "Analytical"}]}}}, {"usr": "Support", "msg": "I'll keep you in mind as my own consultant for customer service. Thanks for being a role model.", "tones": {"document_tone": {"tones": []}}}, {"usr": "Support", "msg": "CCing people all the time is one of the most annoying things you can do via email. I’d say it’s the most annoying, but this honor is bestowed upon the excessive “reply all.” If someone sends an email to you and a bunch of other people, do you really think every recipient needs to get another email from you saying “thanks”? They don’t, and when you do this, it sends people climbing up a wall.", "tones": {"document_tone": {"tones": [{"score": 0.622629, "tone_id": "anger", "tone_name": "Anger"}, {"score": 0.674519, "tone_id": "confident", "tone_name": "Confident"}]}}}, {"usr": "Support", "msg": "Well, there was some proof, but not so much proof you didn't say she was right. You said she might be lying that it's just so far along! You're absolutely wrong. It's more like the whole thing is a lie, because it's so long after she was last seen that it's impossible to even get a picture of her face. Why did you even bring up that! The way she has been telling me all these stories since she disappeared is insane! She's got so many scars on her, yet I have no idea why she still insists that this man she's obsessed with is responsible for her disappearance!", "tones": {"document_tone": {"tones": [{"score": 0.585473, "tone_id": "fear", "tone_name": "Fear"}, {"score": 0.604206, "tone_id": "sadness", "tone_name": "Sadness"}]}}}, {"usr": "Support", "msg": "isn't ryan so dumb! what's with him calling the umpire a loser?!?! that's right~ we're going to lose 1 game, so why are you arguing at half time! you don't want us to lose any? so why are your assholes yelling at umpire? we are winning and the umpire isn't trying to stop us? what the fuck is wrong with these assholes? i can't even read umpire and you were crying in the bullpen lol, do you have any fucking idea who this guy is? that umpire is freaking us out lol. dude this is pathetic. you're doing us a favor and you're trying to save face by saying the umpire is acting like a douche? you look like a douche to me. i know you're upset about our loss for being shitty. well you have every right to be. umpire was saying he was sorry, but he said nothing because there's nothing he could do. even when he says this umpire has never been in an official match between us. so this umpire is acting shitty on top of playing shitty games. you're not gonna see him again until next year because you're too late when that last match will end. umpire is acting shitty because he has no one to blame but himself. ", "tones": {"document_tone": {"tones": [{"score": 0.600991, "tone_id": "sadness", "tone_name": "Sadness"}, {"score": 0.614667, "tone_id": "anger", "tone_name": "Anger"}, {"score": 0.510713, "tone_id": "joy", "tone_name": "Joy"}, {"score": 0.753426, "tone_id": "tentative", "tone_name": "Tentative"}]}}}, {"usr": "Support", "msg": "asd", "tones": {"document_tone": {"tones": []}}}, {"usr": "Support", "msg": "TEsting 123", "tones": {"document_tone": {"tones": []}}}, {"usr": "Support", "msg": "Hola hola pola", "tones": {"document_tone": {"tones": []}}}]}